#include <iostream>
#include <cstdlib>
#include <vector>
#include <ctime>
#include <algorithm>
#include <string>
unsigned counter = 0;
struct Option
{
	Option(const std::string&, const double);
	double val = 0;
	std::string text;
};
Option::Option(const std::string& txt, const double val) : text(txt), val(val)
{
}
class Question
{
public:
	Question(const std::string&);
	void AddOption(const std::string&, const double);
	void AskQuestion();
	int AnswerQuestion();
private:
	std::string m_Question;
	std::vector<Option>m_Answers;
	double m_Score = 0;
};
void Question::AddOption(const std::string& rhs, const double val)
{
	Option opt(rhs, val);
	m_Answers.push_back(opt);
}
Question::Question(const::std::string& task) : m_Question(task)
{
}
int Randomize(const int i)
{
	return std::rand() % i;
}
void Question::AskQuestion()
{
	std::cout << m_Question << "\n\n";
	std::srand(unsigned(std::time(0)));
	for (unsigned i = 0; i < m_Answers.size(); ++i)
		std::swap(m_Answers[Randomize(m_Answers.size())], m_Answers[Randomize(m_Answers.size())]);
	for (unsigned i = 0; i < m_Answers.size(); ++i)
	{
		char ind = i + 65;
		std::cout << ind << ' ' << m_Answers[i].text << '\n';
	}
}

int Question::AnswerQuestion()
{
	char tmp = 'v';
	unsigned tmpToInt;
	std::cin >> tmp;
	tmpToInt = tmp;
	do
	{
		if (tmpToInt < 97)
			tmpToInt -= 65;
		else
			tmpToInt -= 97;
		m_Score += m_Answers[tmpToInt].val;
		std::cin >> tmp;
		tmpToInt = tmp;
	} while (tmp != 's' && tmp != 'S');
	std::cout << "Rezultat: " << m_Score << "\nVeren otgovor(i): ";
	for (unsigned i = 0; i < m_Answers.size(); ++i)
	{
		if (m_Answers[i].val > 0)
		{
			std::cout << char(i + 65) << ' ';
		}
	}
	std::cout << "\nVavedi nqkoi simvol";
	if (m_Score > 0)
	{
		counter++;
	}
	return m_Score;
}
int main()
{
	std::cout << "Test 1 po UK\nIzgotven ot Mapmo\n";
	std::cout << "Za da otgovorite na nqkoi vupros vavedete bukvata(bukvite) i kogato ste gotovi vavedete 's'\n";
	std::cout << "Suobrazete se kak raboti std::cin\nAko jelaete simulaciq bez povtorni opiti natisnete r\nAko jelaete vuprosite, koito oburkate da se zapazvat natisnete proizvolen buton\n";
	char useless;
	std::cin >> useless;
	bool flag = (useless == 'r' ? 1 : 0);
	system("CLS");
	std::vector<Question> exam;
	std::srand(unsigned(std::time(0)));

	Question q0("Koe ot izbroenite e definiciq na Error?");
	q0.AddOption("Nekorektna stypka, proces ili definiciq na danni v kompyutyrna programa", -1);
	q0.AddOption("Nesposobnostta na sistemata ili komponenta da izvyrshi jelanata funkcionalnost v ramkite na specificiranite iziskvaniq na proizvoditelnost", -1);
	q0.AddOption("Choveshko vyzdeystvie, koeto vodi do nekorekten rezultat", 1);
	exam.push_back(q0);

	Question q1("Koe ot izbroenite e definiciq na Fault?");
	q1.AddOption("Nekorektna stypka, proces ili definiciq na danni v kompyutyrna programa", 1);
	q1.AddOption("Nesposobnostta na sistemata ili komponenta da izvyrshi jelanata funkcionalnost v ramkite na specificiranite iziskvaniq na proizvoditelnost", -1);
	q1.AddOption("Choveshko vyzdeystvie, koeto vodi do nekorekten rezultat", -1);
	exam.push_back(q1);

	Question q2("Koe ot izbroenite e definiciq na Failure?");
	q2.AddOption("Nekorektna stypka, proces ili definiciq na danni v kompyutyrna programa", -1);
	q2.AddOption("Nesposobnostta na sistemata ili komponenta da izvyrshi jelanata funkcionalnost v ramkite na specificiranite iziskvaniq na proizvoditelnost", 1);
	q2.AddOption("Choveshko vyzdeystvie, koeto vodi do nekorekten rezultat", -1);
	exam.push_back(q2);
	
	Question q3("Каква е връзката между понятията повреда, грешка и отказ?");
	q3.AddOption("Повреда → Грешка → Отказ ", -1);
	q3.AddOption("Грешка → Повреда → Отказ ", 1);
	q3.AddOption("Отказ → Повреда → Грешка ", -1);
	exam.push_back(q3);
	
	Question q4("При коя фаза от тестовия процес се избират метрики и модели?");
	q4.AddOption("Тестово планиране", 1);
	q4.AddOption("Изпълнение на тестове и наблюдения", -1);
	q4.AddOption("Анализ и проследяване ", -1);
	exam.push_back(q4);
	
	Question q6("?При коя фаза от тестовия процес се дефинират тестовите сценарии?");
	q6.AddOption("Изпълнение на тестовете и наблюдение" , -1);
	q6.AddOption("Тестово планиране и подготовка" , 1);
	q6.AddOption("Анализ и проследяване" , -1);
	exam.push_back(q6);
	
	Question q7("Коя от следните дейности НЕ се изпълнява при подготовка на тестовите сценарии??");
	q7.AddOption("Конструиране на нови тестови сценарии", -1);
	q7.AddOption("Автоматично генериране на тестови сценарии", -1);
	q7.AddOption("Избор на тестови сценарии от съществуващи такива", -1);
	q7.AddOption("Дефиниране на тестова цел", 1);
	exam.push_back(q7);
	
	Question q8("Коя от следните дейности НЕ се извършва при функционалното тестване?");
	q8.AddOption("Наблюдение на външното поведение на софтуерната система", -1);
	q8.AddOption("Дебъгване на софтуерната система", 1);
	q8.AddOption("Създаване на формални тестови модели", -1);
	exam.push_back(q8);
	
	Question q9("При тестването по метода на черната кутия (black box testing) се проверява дали:");
	q9.AddOption("Външните функции на софтуерната система са коректни ", 0.5);
	q9.AddOption("Програмните единици на софтуерната система са коректно реализирани ", -1);
	q9.AddOption("Наблюдаваното поведение на софтуерната система съответства на потребителските очаквания или продуктовата спецификация", 0.5);
	q9.AddOption("Програмните единици на софтуерната система са коректно интегрирани помежду си", -1);
	
	Question q10("При тестването по метода на бялата кутия (white box testing) се проверява дали:");
	q10.AddOption("Външните функции на софтуерната система са коректни ", -1);
	q10.AddOption("Програмните единици на софтуерната система са коректно реализирани", 0.5);
	q10.AddOption("Наблюдаваното поведение на софтуерната система съответства на потребителските очаквания или продуктовата спецификация", -1);
	q10.AddOption("Програмните единици на софтуерната система са коректно интегрирани помежду си", 0.5);
	
	Question q11("Кое от следните НЕ е вярно за структурното тестване?");
	q11.AddOption("Софтуерната система се разглежда като бяла кутия ", -1);
	q11.AddOption("Откриването на дефекти е по-лесно, тъй като се отстраняват проблеми в малки програмни единици ", -1);
	q11.AddOption("Прилага се на по-късните етапи от разработката на софтуерната система", 1);
	q11.AddOption("Използва специфични техники на тестване", -1);
	
	Question q12("Какво тестване се прилага на ниво разработване върху компонентите?");
	q12.AddOption("Юнит „блек бокс“ тестване", -1);
	q12.AddOption("Юнит „уайт бокс“ тестване", 1);
	q12.AddOption("Интеграционно ", -1);
	q12.AddOption("Тестване за приемане", -1);
	
	Question q13("Кога тестов процес може да спре?");
	q13.AddOption("Когато са отстранени всички дефекти в софтуерната система ", -1);
	q13.AddOption("Когато е достигнато определено ниво на тестово покритие", 0.5);
	q13.AddOption("Когато е достигнато определено ниво на надеждност", 0.5);
	q13.AddOption("Когато всички тестови сценарии са изпълнени успешно", -1);
	
	Question q14("Тестовите сценарии се състоят от:");
	q14.AddOption("Последователни стъпки за реализиране на определен тестов процес,  предпоставки и входни данни за изпълнение на тези стъпки, очаквани разултати при използване на определен набор от входни данни ", 1);
	q14.AddOption("Тестови проекти за изследване на определени бизнес процеси в дадена софтуерна система", -1);
	
	Question q15("Какво е предназначението на тестовия оракул?");
	q15.AddOption("Предсказване на очаквания резултат от изпълнението на тестовите сценарии ", 1);
	q15.AddOption("Планиране на тестовия процес", -1);
	q15.AddOption("Предсказване на получения резултат от изпълнението на тестовите сценарии ", -1);
	
	Question q16("Кои от изброените дейности подлежат на автоматизация?");
	q16.AddOption("Изпълнение на тестове ", 0.5);
	q16.AddOption("Анализ на тестовото покритие", 0.5);
	q16.AddOption("Фиксиране на проблеми", -1);
	q16.AddOption("Планиране на тестовата процедура ", -1);
	
	Question q17("Кое от изброените НЕ е свойство на софтуерното измерване?");
	q17.AddOption("Обективност", -1);
	q17.AddOption("Валидност", -1);
	q17.AddOption("Консистентност", 1);
	q17.AddOption("Надеждност", -1);
	
	Question q18("Кое от изброентие НЕ е дейност на софтуерното измерване?");
	q18.AddOption("Формулиране на метричната система", -1);
	q18.AddOption("Анализиране" , -1);
	q18.AddOption("Верифициране" , 1);
	q18.AddOption("Осъществяване на обратна връзка ", -1);
	
	Question q19("От коя гледна точка за качеството означава съответствие със спецификацията?");
	q19.AddOption("абстрактна", -1);
	q19.AddOption("потребителска", -1);
	q19.AddOption("на производителя/разработчика", 1);
	q19.AddOption("базиран на цената", -1);
	
	Question q20("Какво НЕ е характерно за класическите модели на качество?");
	q20.AddOption("Фокусират се върху качеството на крайния продукт", -1);
	q20.AddOption("Задават ключовите атрибути на качеството от гледна точка на потребителите", 1);
	q20.AddOption("Дават представа за това как избраните фактори на качество се развиват в рамките на проекта", -1);
	
	Question q21("Кое от изброените НЕ е аспект на качеството от универсалния модел ISO  - 9 126?");
	q21.AddOption("Качество при промяна на продукта", 1);
	q21.AddOption("Качество на процеса за създаване на продукт ", -1);
	q21.AddOption("Вътрешно качество на продукта", -1);
	q21.AddOption("Вътрешно качество на продукта", -1);
	
	Question q22("Коя от изброените НЕ е под-характеристика на характеристиката Usability според стандарта за качество ISO - 9 126?");
	q22.AddOption("Recoverability", 1);
	q22.AddOption("Learnability", -1);
	q22.AddOption("Understandability", -1);
	q22.AddOption("Operability", -1);
	
	Question q23("Коя от изброените НЕ е под-характеристика на характеристиката Funcionality според стандарта за качество ISO - 9 126?");
	q23.AddOption("Interoperability", -1);
	q23.AddOption("Suitability ", -1);
	q23.AddOption("Accuracy", -1);
	q23.AddOption("Understandability", -1);
	
	Question q24("Коя от изброените НЕ е под-характеристика на характеристиката Maintainability според стандарта за качество ISO - 9 126?");
	q24.AddOption("Changeability ", -1);
	q24.AddOption("Testability", -1);
	q24.AddOption("Installability", 1);
	q24.AddOption("Stability", -1);
	
	Question q25("Коя от изброените НЕ е под-характеристика на характеристиката Portability според стандарта за качество ISO - 9 126?");
	q25.AddOption("Changeability", 1);
	q25.AddOption("Testability", -1);
	q25.AddOption("Installability", -1);
	q25.AddOption("Stability", -1);
	
	Question q26("Кое е характерно за съвременните модели на качество?");
	q26.AddOption("Фокусират се върху качеството на крайния продукт ", 0.5);
	q26.AddOption("Дават представа за това как избраните фактори за качество се развиват в рамките на проекта", 0.5);
	q26.AddOption("Задават ключовите атрибути на качеството от гледна точка на потребителите", -1);
	q26.AddOption("Йерархични модели са", -1);
	
	Question q27("Кои от изброените твърдения са верни за модела на качество на  NASA –SATC?");
	q27.AddOption("Дефинира множество от цели, които са свързани с факторите за качество на софтуерния продукт", 0.5);
	q27.AddOption("Обхваща три обособени области в употребата на софтуерния продукт", -1);
	q27.AddOption("Обвързан е силно с управлението на риска в проекта", 0.5);
	q27.AddOption("Статичен е и не дава представа как избраните фактори за качество се развиват в рамките на проекта", -1);
	
	Question q28("Кои от изброените са метрики за ефективност на тестването на модел NASA - SATC?");
	q28.AddOption("Грешки и оценка за критичността им", 0.5);
	q28.AddOption("Време за откриване на грешките", 0.5);
	q28.AddOption("Честота на грешките", -1);
	q28.AddOption("Сериозност на грешките", -1);
	
	Question q29("Какво означава Уместна метрика на качеството?");
	q29.AddOption("Не измерва атрибути, вече измервани от други метрики", -1);
	q29.AddOption("Приложима в различни ситуации", -1);
	q29.AddOption("Измерва атрибут от голямо значение", 1);
	q29.AddOption("Измерва искания атрибут", -1);
	
	Question q30("Какво означава свойството Надеждност на софтуерното измерване?");
	q30.AddOption("Мярката да има необходимата различаваща способност", -1);
	q30.AddOption("Получаваните мерки да отразяват реално свойствата на измервания обект", -1);
	q30.AddOption("Получаваните мерки да не зависят от субекта, извършващ измерването", -1);
	q30.AddOption("При повтаряне на измерването при еднакви условия да се получават еднакви резултати", 1);
	
	Question q31("Кои от изброените са метрики за качество на софтуерния процес?");
	q31.AddOption("Честота на грешите ", 0.5);
	q31.AddOption("MTTF (Време между две аварии)", -1);
	q31.AddOption("Проблеми, идентифицирани от потребителите", -1);
	q31.AddOption("Сериозност на грешките", 0.5);
	
	Question q32("Метриката многократно използване на код (code reuse) е свързана с");
	q32.AddOption("Качество на проекта", -1);
	q32.AddOption("Качество на софтуерния продукт", -1);
	q32.AddOption("Качество на софтуерния процес", -1);
	q32.AddOption("Продуктивност на софтуерния процес", 1);
	
	Question q33("Кои от изброените са метрики за продукт?");
	q33.AddOption("MTTF Време между две аварии", 1);
	q33.AddOption("Ниво на дефектите ", -1);
	q33.AddOption("Честота на грешките ", -1);
	q33.AddOption("Сериозност на грешките", -1);
	
	Question q34("Кои от изброените са метрики за поддръжка на софтуера?");
	q34.AddOption("Време за отстраняване на грешките", 0.5);
	q34.AddOption("Брой погрешно обработени грешки", 0.5);
	q34.AddOption("Честота на грешки от кодиране", -1);
	q34.AddOption("Средна сериозност на грешки от разработване", -1);
	
	Question q35("При коя от изброените дейности НЕ се регистрират грешки?");
	q35.AddOption("Специфиране на софтуерните изисквания", 1);
	q35.AddOption("Ревю на документацията – в спецификациите за проекта или в потребителската документация", -1);
	q35.AddOption("Преглед на фазите и инспекция на проекта", -1);
	q35.AddOption("Работа на системата в гаранционен период", -1);
	
	Question q36("Използването на контролни списъци се ограничава поради:");
	q36.AddOption("Трудности при покриване на всички функционални или структурни компоненти от различни гледни точки и при различни нива на гранулярност", 0.5);
	q36.AddOption("Трудности при създаване на контролни списъци от елементите на спецификацията", -1);
	q36.AddOption("Трудности при създаване на контролни списъци от характеристиките на софтуерната система ", -1);
	q36.AddOption("Трудности при описание на сложни взаимодействия между различните системни компоненти или между главните системни функции", 0.5);
	
	Question q37("Кое от следните свойства е характерно за класовете на еквивалентност?");
	q37.AddOption("Изградени са от подмножества, които се припокриват", -1);
	q37.AddOption("Изградени са от множества, които са взаимно изчерпателни", -1);
	q37.AddOption("Изградени са от подмножества, в които елементите предизвикват различно поведение на софтуерната система", 1);
	
	Question q38("При тестване с класове на еквивалентност се извършва разделяне на тестовите сценарии на групи:");
	q38.AddOption("Които са с еднакви гранични стойности", -1);
	q38.AddOption("За които при еднакви входни данни се получават различни тестови резултати", -1);
	q38.AddOption("За които се предполага, че предизвикват еквивалентно поведение на системата ", 1);
	
	Question q39("При статистическото тестване, базирано на употреба се използват:");
	q39.AddOption("Контролни списъци", -1);
	q39.AddOption("Класове на еквивалентност", -1);
	q39.AddOption("Таблици за взимане на решения", -1);
	q39.AddOption("Оперативни профили", 1);
	
	Question q40("Какво представлява оперативния профил?");
	q40.AddOption("Количествена характеристика за начина, по който системата се използва", 1);
	q40.AddOption("Модел на функционалността, предлагана от системата", -1);
	q40.AddOption("Набор от качествени показатели за работата на системата", -1);
	
	Question q41("При създаването на оперативен профил по процедурата Муса-1 се извършва:");
	q41.AddOption("Дефиниране на цялостното множество от клиентски категории с теглови коефициенти, определени от фактор за използване", -1);
	q41.AddOption("Идентифициране на множества от операции, които се използват съвместно и определяне на съответстващите им теглови коефициенти", -1);
	q41.AddOption("Транслиране на функциите от високо ниво в детайлни операции и определяне на тяхната вероятност за използване", 1);
	
	Question q42("Какви са трудностите при действителното измерване на използваемостта при потребителите?");
	q42.AddOption("Ниска точност на създадения оперативен профил", -1);
	q42.AddOption("Невъзможност за приложение при нови продукти и нови приложения", 0.5);
	q42.AddOption("Наличие на ограничения при използване на корпоративни и лични данни", 0.5);
	q42.AddOption("Точността на проучването се влияе от познанията на потребителите за функционалността на продукта", -1);
	
	Question q43("Как се интерпретират проблемите с изходите при машините на крайните състояния?");
	q43.AddOption("Като проблеми с преходите", 1);
	q43.AddOption("Като проблеми със състоянията", -1);
	q43.AddOption("Като проблеми с преходите и състоянията", -1);
	
	Question q44("От какво зависи броят на тестовите сценарии при тестване с машина на крайните състояния?");
	q44.AddOption("Общия брой състояния ", -1);
	q44.AddOption("Броят на входните и изходните състояния", 1);
	q44.AddOption("Броят на преходите", -1);
	q44.AddOption("Разнообразието на входните и изходните данни", -1);
	
	Question q45("Кой от следните проблеми е типичен за тестването с машина на крайните състояния?");
	q45.AddOption("Невъзможност за тестване на обектно-ориентирани системи", -1);
	q45.AddOption("Невъзможност за тестване на софтуерни системи с графичен потребителски интерфейс", -1);
	q45.AddOption("Трудно постигане на тестово покритие при големи софтуерни системи", 1);
	
	Question q46("Как се осигурява пълно покритие при домейн тестването?");
	q46.AddOption("Избират се гранични точки от всеки поддомейн", -1);
	q46.AddOption("Избира се по една вътрешна точка от всеки поддомейн", 1);
	q46.AddOption("Избират се минимум две вътрешни точки от всеки поддомейн", -1);
	
	Question q47("При тестване на входния домейн каква е причината дадена софтуерна система да произвежда различни изходи при един и същ вход?");
	q47.AddOption("Дефиниране на изчислителни процедури за отделни поддомейни, някои от които се припокриват", 1);
	q47.AddOption("Дефиниране на изчислителни процедури само за определени поддомейни от общия входен домейн", -1);
	q47.AddOption("Дефиниране на изчислителни процедури за взаимоизключващи се поддомейни", -1);
	
	Question q48("От какво естество са проблемите, свързани с изместване на граница на домейн?");
	q48.AddOption("Специфициране на отворена граница като отворене и реализиране като затворена", -1);
	q48.AddOption("Разминаване между очакваната и действително специфицирана или реализирана граница ", 1);
	q48.AddOption("Сливане на два различни поддомейна в общ поддомейн", -1);
	q48.AddOption("Наличие на поддомейни, които са с еднакви свойства", -1);
	
	Question q49("Какъв е броят на тестовите сценарии при тестване с комбинация на екстремни точки?");
	q49.AddOption("2^n", -1);
	q49.AddOption("2^n + 1", -1);
	q49.AddOption("4^n", -1);
	q49.AddOption("4^n  + 1", 1);
	
	Question q50("Определете тестовите точки за едномерен домейн 0 ≤ x < 21 в случай на тестване с комбинация от екстремни точки?");
	q50.AddOption("-1,0,10,21,22", 1);
	q50.AddOption("-1,0,1,10,20,21,22", -1);
	q50.AddOption("1,0,1,20,21,22", -1);
	q50.AddOption("1,0,21,22", -1);
	
	Question q51("Как се избира \"OFF\" точка при затворена граница, когато се прилага стратегията \"weak N x 1\"?");
	q51.AddOption("Като OFF точка се избира външна точка, която е много близо до границата", 1);
	q51.AddOption("Като OFF точка се избира вътрешна точка, която е много близо до границата", -1);
	q51.AddOption("Като OFF точка се избира произволна точка", -1);
	
	Question q52("Къде се намира OFF точката, когато се прилага стратегията weak Nx1, ако границата е затворена и е налице изместване на границата?");
	q52.AddOption("OFF точката е на дистанция ε от границата ", -1);
	q52.AddOption("OFF точката ще бъде извън поддомейна", 1);
	q52.AddOption("OFF точката ще бъде в поддомейна", -1);
	
	Question q53("Какви са ON и OFF точките за едномерен домейн 0 ≤ x < 21, когато се прилага стратегията weak N x 1?");
	q53.AddOption("ON точки: x = 0 и x = 21; OFF точки: x = -1", -1);
	q53.AddOption("ON точки: x = 0 и x = 21; OFF точки: x = -1 и x = 20", 1);
	q53.AddOption("ON точки: x = 0 и x = 21; OFF точки: x = 20", -1);
	
	Question q54("Boundary Value Testing е техника за:");
	q54.AddOption("Оптимизация на Test cases", -1);
	q54.AddOption("Проектиране на тестове за сигурност", 1);
	q54.AddOption("Задължителна техника при System testing", -1);
	
	Question q55("Таблицата на решенията е техника за тестване при която се:");
	q55.AddOption("Изследва ефекта от комбинацията на различни входове и други състояния на софтуера, които трябва правилно да имплементират бизнес правила.", 1);
	q55.AddOption("Изследва ефекта при подаване на еднакви входове на систамата и се очаква получаване на различни изходи в зависимост от настъпили събития", -1);
	q55.AddOption("Изследва ефекта от настъпването на различни събития в системата", -1);
	
	Question q56("ои пътища се елиминират при конкатенация на два бинарни подграфа с противоположни условия C1 = -C2, в случай на тестване с граф на управляващия поток?");
	q56.AddOption("TT и FF", 1);
	q56.AddOption("TF и FF", -1);
	q56.AddOption("TT FT", -1);
	q56.AddOption("", -1);
	
	Question q57("Кой път се елиминира при конкатенация на два бинарни подграфа с противоположни условия C1 = (x > 0) и C2 = (x < 100) в случай на тестване с граф на управляващия поток?");
	q57.AddOption("TT", -1);
	q57.AddOption("FT", -1);
	q57.AddOption("TF", -1);
	q57.AddOption("FF", 1);
	
	Question q58("Какви проблеми могат да бъдат открити при тестване на долна граница на цикъл, когато цикълът се изпълнява еднократно?");
	q58.AddOption("Проблеми, които пречат на повторното изпълнение на цикъла", -1);
	q58.AddOption("Проблеми, свързани с инициализацията на цикъла и начално установяване", 1);
	q58.AddOption("Проблеми, свързани с инициализацията на цикъла", -1);
	
	Question q59("Каква е целта на тестването на данновите зависимости?");
	q59.AddOption("Верификация на коректното реализиране на взаимовръзките между програмните променливи", 1);
	q59.AddOption("Верификация на логическата последователност на изпълнение на програмата", -1);
	q59.AddOption("Верификация на коректното реализиране на взаимовръзките между програмните модули", -1);
	
	Question q60("Коя от изброените релации се игнорира при анализ на данновите зависимости?");
	q60.AddOption("D-U реалция", -1);
	q60.AddOption("D-D релация", -1);
	q60.AddOption("U-U релация", 1);
	q60.AddOption("U-D релация", -1);
	
	Question q61("Какъв тип са релациите при конструирането на граф на данновите зависимости?");
	q61.AddOption("D-U релация", 1);
	q61.AddOption("D-D релация", -1);
	q61.AddOption("U-D релация", -1);
	q61.AddOption("U-U релация", -1);
	
	Question q62("Как се инициализират променливите, представляващи даннов вход при тестване с граф на управляващия поток?");
	q62.AddOption("Избира се стойност, която осигурява подходящо изчисляване на предиката", -1);
	q62.AddOption("Избира се случайна стойност", 1);
	q62.AddOption("Избира се стойност, която осигурява получаване на точно определен изход от изпълнението на програмата", -1);
	
	Question q63("Кое от следните твърдения НЕ е вярно за графа на данновия поток?");
	q63.AddOption("Представлява специален тип машина на крайните състояния", 1);
	q63.AddOption("Представя детайлите на взаимодействието и данновите зависимости", -1);
	q63.AddOption("Характеризира се с по-големи ограничения при представяне на циклите в сравнение с графа на управляващия поток", -1);
	
	Question q64("Кое от следните твърдения НЕ е вярно за графа на управляващия поток?");
	q64.AddOption("Представлява специален тип машина на крайните състояния", -1);
	q64.AddOption("Представлява програмен код или потока на изпълнение, асоцииран с последователните изчислителни модели", -1);
	q64.AddOption("Характеризира се с по-голяма сложност в сравнение с графа на данновия поток", 1);
	
	Question q65("Коя от изброените активности за осигуряване на качеството НЕ се класифицира като активност на валидация?");
	q65.AddOption("Интеграционно тестване (Integration testing)", 1);
	q65.AddOption("Тестване на ниво система (System testing)", -1);
	q65.AddOption("Активности, свързани с осигуряване на сигурност(Software safety assurance activities)", -1);
	q65.AddOption("Активности, свързани с отказоустойчивост (Software fault tolerance)", -1);
	
	Question q66("Кога може да се извърши тестването за приемане на системата?");
	q66.AddOption("В края на системното тестване", 1);
	q66.AddOption("След бета тестването", -1);
	q66.AddOption("В края на интеграционното тестване", -1);
	
	Question q67("Kакво представлява мутацията на софтуерна единица?");
	q67.AddOption("Модификация в програмата, реализирана чрез въвеждане на единична, малка, синтактично неправилна промяна в кода", -1);
	q67.AddOption("Модификация в програмата, реализирана чрез оптимизация на нейния код", -1);
	q67.AddOption("Модификация в програмата, реализирана чрез въвеждане на единична, малка, синтактично правилна промяна в кода", -1);
	
	Question q68("Регресионното тестване включва:");
	q68.AddOption("Създаване на нови тестове и тяхното изпълнение", -1);
	q68.AddOption("Приоритизиране на съществуващи тестове и тяхното изпълнение", -1);
	q68.AddOption("Изпълнение на всички съществуващи тестове", 1);
	q68.AddOption("Създаване на нови тестове и тяхното изпълнение заедно със съществуващи тестове", -1);
	
	Question q69("Целта на регресионното тестване е да удовлетвори:");
	q69.AddOption("Правилната имплементаия на определен бизнес процес след корекция  на регистрирани грешки, при което не са възникнали нови грешки в свързани с този процес сценарии (модули)", 1);
	q69.AddOption("Работоспособността на софтуерното решение при максимално допустимо натоварване", -1);
	
	Question q70("Каква е същността на стрес тестовете?");
	q70.AddOption("Доказване, че софтуерната система не може да обработи големи обеми от данни, специфицирани в целите й", -1);
	q70.AddOption("Натоварване на софтуерната система с голям обем от данни или дейности за кратък период от време", 1);
	q70.AddOption("Проверка дали изходът от софтуерната система е смислен за потребителя", -1);
	q70.AddOption("Доказване, че софтуерната система може да се възстанови след срив", -1);
	
	Question q71("Stress testing се изпълнява за да се изследват изисквания, свързани с:");
	q71.AddOption("Security requirements", -1);
	q71.AddOption("Performance Requirements", 1);
	q71.AddOption("Functional Requirements ", -1);
	
	Question q72("Кои свойства на софтуерната система се тестват при тестване на използваемостта?");
	q72.AddOption("Съответствие на потребителския интерфейс и индивидуалните характеристики на потребителите", 0.5);
	q72.AddOption("Време за отговор", -1);
	q72.AddOption("Разбираемост на съобщенията за грешка", 0.5);
	q72.AddOption("Обемът данни, който може да бъде обработен от софтуерната система", -1);
	
	Question q73("Кое е цел на тестването на производителност:");
	q73.AddOption("Да се проследи времето за отговор на системата", 0.5);
	q73.AddOption("Да се валидира дали системата покрива бизнес изискванията", 0.5);
	q73.AddOption("Да се намери оптималната конфигурация на хардуерните и софтуерните ресурси", -1);
	q73.AddOption("Да се открие максимален брой потребители", -1);
	
	Question q74("Кое от изброените НЕ е цел на тестването на производителност?");
	q74.AddOption("Да се проследи времето за отговор на системата", -1);
	q74.AddOption("Да се валидира дали системата покрива бизнес изискванията", -1);
	q74.AddOption("Да се намери оптималната конфигурация на хардуерните и софтуерните ресурси", 0.5);
	q74.AddOption("Да се открие максимален брой потребители", 0.5);
	
	Question q75("Кои свойства на софтуерната система НЕ се тестват при тестване на производителността:");
	q75.AddOption("Време за отговор", -1);
	q75.AddOption("Пропускателна способност", -1);
	q75.AddOption("Конфигурируемост", 0.5);
	q75.AddOption("Унифицираност на потребителския интерфейс", 0.5);
	
	Question q76("Тестът за издръжливост е");
	q76.AddOption("Тест за производителност, при който се определят характеристиките  ... (не разчитам) ... се очаква да възникнат в продукционна среда за продължителен период от време", -1);
	q76.AddOption("Тест за производителност, при който се определят характеристиките на......модели и товари, които се очертава да възникнат в продукционна среда в кратък период от време", -1);
	q76.AddOption("Тест за производителност, при който се определят характеристиките на ........модели и товари, които надвишават очакваните в продукционна среда", 1);
	
	Question q77("Кое от изброените НЕ е цел на прегледа на предложението за договор?");
	q77.AddOption("Изискванията на клиента трябва да са ясни и документирани", -1);
	q77.AddOption("Специфициране на формалните аспекти на взаимоотношенията между потребителя и софтуерната фирма ", -1);
	q77.AddOption("Специфициране на технологичното решение", 1);
	q77.AddOption("Определяне и защита на интелектуалните права", -1);
	
	Question q78("Процес или среща по време, на която работен продукт или работни процедури се предоставят пред членове на проекта, управляващ персонал, потребители или други заинтересовани лица за коментари или одобрение се нарича:");
	q78.AddOption("Осигуряване на качеството", -1);
	q78.AddOption("Контрол на качеството", -1);
	q78.AddOption("Преглед в проект", 1);
	q78.AddOption("Оптимизиране на процеса", -1);
	
	Question q79("Изследването на различни артефакти на процеса с цел да се открият аномалии и дефекти се нарича:");
	q79.AddOption("Осигуряване на качеството", -1);
	q79.AddOption("Преглед в проект", 1);
	q79.AddOption("Планиране на качеството ", -1);
	q79.AddOption("Контрол на качеството", -1);
	
	Question q80("Кои от изброените цели на прегледите в проект са директни цели?");
	q80.AddOption("Да се документират грешки при анализа на дизайна, които да служат като основа за бъдещи коригиращи дейности", -1);
	q80.AddOption("Да се идентифицират нови рискове, които има вероятност да засегнат завършването на проекта", 0.5);
	q80.AddOption("Да се открият грешки (при анализа или дизайна) или обект, където са необходими корекции, промени и допълнения по отношение на оригиналните спецификации и одобрени промени", 0.5);
	q80.AddOption("Да се осигури възможност за неформални срещи за обмен на професионално знание за методите, средствата и техниките на разработване", -1);
	
	Question q81("Кои от изброените цели на прегледите в проект са индиректни цели?");
	q81.AddOption("Да се документират грешки при анализа и дизайна, които да служат като основа за бъдещи коригиращи дейности", 0.5);
	q81.AddOption("Да се идентифицират нови рискове, които има вероятност да засегнат завършването на проекта", -1);
	q81.AddOption("Да се открият грешки (при анализа или дизайна) или обекти, където са необходими корекции, промени и допълнения по отношение на оригиналните спецификации и одобрени промени", -1);
	q81.AddOption("Да се осигури възможност за неформални срещи за обмен на професионално знание за методите, средствата и техниките на разработване", -1);
	
	Question q82("Кое НЕ е преглед на ниво проект:");
	q82.AddOption("Контрол на изпълнението на утвърдения фирмен процес", -1);
	q82.AddOption("Приемно тестване от клиента", 1);
	q82.AddOption("Одит от външни организации", -1);
	q82.AddOption("Клиентът трябва да участва в инпекцията", -1);
	
	Question q83("Коя техника за осигуряване на качеството е по-подходяща, ако дефектите са всепроникващи в софтуерната система?");
	q83.AddOption("Тестване", -1);
	q83.AddOption("Систематични инспекции", 1);
	
	Question q84("Кои от изброените твърдения НЕ са верни за инспекциите?");
	q84.AddOption("Инспекциите могат да докажат съвместимост с реалните очаквания на клиента", 0.5);
	q84.AddOption("Инспекциите могат да докажат съвместимост със спецификацията", -1);
	q84.AddOption("Инспекциите могат да проверят нефункционалните изисквания", 0.5);
	q84.AddOption("Инспекциите и тестването не са противоречиви техники за верификация", -1);
	
	Question q85("Кое твърдение е НЕвярно?");
	q85.AddOption("Инспекциите и тестването взаимно се допълват като техники за верификация", -1);
	q85.AddOption("И инспекциите, и тестването трябва да бъдат използвани по време на В & В процеса", -1);
	q85.AddOption("Инспекциите могат да докажат съвместимост с реалните очаквания на клиента", 1);
	q85.AddOption("Инспекциите не могат да проверят нефункционалните изисквания", -1);
	
	Question q86("Кое твърдение е вярно?");
	q86.AddOption("Инспекциите и тестването са противоречиви техники за верификация", -1);
	q86.AddOption("Инспекциите повишават цената на процеса на разработване", 1);
	q86.AddOption("Инспекциите могат да докажат съвместимост с реалните очаквания на клиента", -1);
	q86.AddOption("Инспекциите могат да проверяват нефункционални изисквания", -1);
	
	Question q87("Кое от изброените НЕ е предусловие за инспекции:");
	q87.AddOption("Трябва да има детайлна спецификация", -1);
	q87.AddOption("Членовете на екипа трябва да са запознати със стандартите на организацията", -1);
	q87.AddOption("Трябва да има синтактично верен код или други репрезентации на системата ", -1);
	q87.AddOption("Клиентът трябва да участва в инспекцията", 1);
	
	Question q88("При екстремното програмиране (XP) кои практики са обвързани с методологията за разработка на софтуер, базиран на тестове (TDD)?");
	q88.AddOption("Програмиране по двойки (Pair programming)", 0.33);
	q88.AddOption("Метафора  (metaphor)", -1);
	q88.AddOption("Рефакторинг (refactoring) ", 0.33);
	q88.AddOption("Опростен дизайн (simple design)", 0.34);
	q88.AddOption("Единен екип (whole team)", -1);
	
	Question q89("Каква е връзката между понятията дефект и повреда, грешка, отказ");
	q89.AddOption("Дефект и грешка са едно и също понятие", -1);
	q89.AddOption("Дефект и повреда са едно и също понятие", -1);
	q89.AddOption("Дефект и отказ са едно и също понятие", -1);
	q89.AddOption("Дефект е събирателно понятие за повреда, грешка и отказ", -1);
	
	Question q90("Кои от изброените техники са за Превенция на дефектите ( Defect prevention)?");
	q90.AddOption("Инспекции на артефакти", -1);
	q90.AddOption("Формални методи", 0.5);
	q90.AddOption("Много версионно програмиране (N version programming)", -1);
	q90.AddOption("Обучение", 0.5);
	
	Question q91("Коя от изброените техники е подходяща и за двете дейности – Превенция на дефектите (Defect prevention) и Откриване/ Отстраняване на дефекти?");
	q91.AddOption("Тестване", -1);
	q91.AddOption("Дефиниране и придържане към стандартни процеси", -1);
	q91.AddOption("Формални методи", -1);
	q91.AddOption("Инспекции", 1);
	
	Question q92("Кои от изброените НЕ са верни според класификацията на процеса от CMMI модел:");
	q92.AddOption("Първоначален – естествено неконтролируем", -1);
	q92.AddOption("Повторяем – дефинирани са и се използват процедури и стратегии за управление на процеса", 0.5);
	q92.AddOption("Дефиниран – дефинирани са и се използват процедури за управление на продукта", 0.5);
	q92.AddOption("Управляем – дефинирани са и се използват процедури и стратегии за управление на качеството", -1);
	
	Question q93("Кои от изброените са верни за CMMI рамка на процеса?");
	q93.AddOption("Използва се като средство да се оцени степента, до която процесът в дадена организация следва най-добрите практики", 1);
	q93.AddOption("Занимава се с това какви са целите, които трябва да се постигнат, а не с това как се правят нещата", -1);
	q93.AddOption("Чрез предоставяне на средства за оценяване се идентифицират слаби области в процеса, които да бъдат подобрени", -1);
	q93.AddOption("Организациите могат да използват едновременно елементи от различните нива, за да се премине към по-високо", -1);
	
	Question q94("Кои от изброените фактори за качеството на продукта са най-важни при  малки проекти?");
	q94.AddOption("Технология на разработване", 0.5);
	q94.AddOption("Опит на екипа", 0.5);
	q94.AddOption("Цена, време, график", -1);
	q94.AddOption("Качество на процеса", -1);
	
	Question q95("Коя техника е подходяща за откриване на статични и локализирани повреди?");
	q95.AddOption("Тестване", -1);
	q95.AddOption("Инспекции", 1);
	q95.AddOption("Отказоустойчивост", -1);
	
	Question q96("Каква е връзката между дейностите управление на дефектите (Defect handling) и ограничаване на дефектите (Defect containment)?");
	q96.AddOption("Има тясна връзка", -1);
	q96.AddOption("Не са тясно свързани", 1);
	
	Question q97("Коя техника е по-подходяща за осигуряване на отказоустойчивост (fault tolerance), когато производителността или бързото взимане на решение са критични?");
	q97.AddOption("N-версионно програмиране (NVP) ", 1);
	q97.AddOption("Recovery block", -1);
	
	Question q98("Верификация (Verification) представлява:");
	q98.AddOption("Дейности (тестове), с които се потвърждава, че софтуерното решение отговаря на специфираните изисквания за него, документирани в спецификации", 1);
	q98.AddOption("Дейности, с които се потвърждава, че софтуерното решение покрива нуждите, за които се създадено", -1);
	q98.AddOption("Дейности/Тестове, които се изпълняват от независим тестов екип", -1);
	
	Question q99("Планът за тестване се съгласува и допълва следния документ:");
	q99.AddOption("Бизнес план", -1);
	q99.AddOption("План на проекта", 1);
	q99.AddOption("План за поддръжка", -1);
	
	Question q100("Какво основна цел има етапът Анализ на изискванията?");
	q100.AddOption("Да се осигури ефективна медология за управление на програмната разработка", -1);
	q100.AddOption("Да дефинира бизнес потребностите на клиента", -1);
	q100.AddOption("Да определи времевата рамка на проекта", -1);
	q100.AddOption("Всички изброени", 1);
	
	Question q101("Кои са ефективните инструменти за анализ на изискванията?");
	q101.AddOption("Преговори", -1);
	q101.AddOption("Сравнение с подобни проекти", -1);
	q101.AddOption("Подробен дизайн", -1);
	q101.AddOption("Интервюта и фокус групи", 1);
	
	Question q102("На какво трябва да се базира разработката на конкретен тест план?");
	q102.AddOption("На избраната методология за тестване", -1);
	q102.AddOption("На опита на тест екипа", -1);
	q102.AddOption("На дизайна на програмната система", -1);
	q102.AddOption("На анализа на изискванията", 1);
	
	Question q103("Какво включва описанието на типовете тестове в тест плана?");
	q103.AddOption("Цели, обхват, процес, среда, екип", -1);
	q103.AddOption("Цели, обхват, процес, време, отговорности", -1);
	q103.AddOption("Цели, обхват, процес, критерии, резултати", 1);
	q103.AddOption("Цели, обхват, процес, контрол, екип", -1);
	
	Question q104("Кой от долу изброените фактори влияе на определянето на приоритетите на тестовите дейности?");
	q104.AddOption("Технически фактори", -1);
	q104.AddOption("Бизнес критичност", -1);
	q104.AddOption("Потребителски фактори", -1);
	q104.AddOption("Всички изброени", 1);
	
	Question q105("В гъвкавите методологии за разработване на софтуер:");
	q105.AddOption("Не са застъпени принципи за осигуряване на качеството на разработваната система", -1);
	q105.AddOption("Са застъпени предимно практики за осигуряване на качеството на разработвания продукт", 1);
	q105.AddOption("Са застъпени само практики за провеждане на ревюта и одити в проектите", -1);
	
	Question q106("Кое от изброените НЕ е  характеристика на компонентната тестабилност (Component testablity)? ");
	q106.AddOption("Променяемост", 1);
	q106.AddOption("Контролируемост", -1);
	q106.AddOption("Наблюдаемост", -1);
	q106.AddOption("Проследяемост", -1);
	
	Question q107("Кое от изброените НЕ е част от Техническото оценяване при компонентното разработване? ");
	q107.AddOption("Интегриране", -1);
	q107.AddOption("Верифициране", -1);
	q107.AddOption("Валидиране", -1);
	q107.AddOption("Поддръжка", 1);
	
	Question q108("Кое от изброените най-добре характеризира резултата на повишаване на качеството в процеса?");
	q108.AddOption("Подобрена продуктивност, подобрена ефективност, намален риск от гледна точка на цена", 1);
	q108.AddOption("Намалена продуктивност, няма влияние върху ефективността и цената", -1);
	q108.AddOption("Намалена продуктивност и нарастване на цената на продукта ", -1);
	q108.AddOption("Подобрена продуктивност и подобрена ефективност от гледна точка на цената", -1);
	
	Question q109("Кои от изброените са стъпки при промяната на процес?");
	q109.AddOption("Приоритизиране", -1);
	q109.AddOption("Обучение", -1);
	q109.AddOption("Настройване- Тунинг", -1);
	q109.AddOption("Всички от изброените", 1);
	
	Question q110("Посочете кои твърдения са верни за инструментите базирани на записване и изпъление скриптове (например Rational Functional Tester):");
	q110.AddOption("Не е необходима готова имплементирана функционалност за да бъдат създадени скриптове", -1);
	q110.AddOption("Процесът по създаване на скриптовете е много трудоемък", -1);
	q110.AddOption("Скриптовете се изпълняват на ниво транспортен протокол", -1);
	q110.AddOption("Могат да се използват за тестване както на уеб, така и на десктоп приложения", 1);
	
	Question q111("Кое от посочените по-долу твърдения, свързани с автоматизираното тестване е вярно: ");
	q111.AddOption("Автоматизираното тестване трябва да се прилага във всеки софтуерен проект", -1);
	q111.AddOption("Избраните архитектурни и технологични решения в проекта не влияят при избора на инструменти за тестване", -1);
	q111.AddOption("Съществуват излючително малко на брой инструменти за автоматизация на тестването", 1);
	
	Question q112("Кои от посочените по-долу твърдения, свързани с автоматизираното тестване са ГРЕШНИ:");
	q112.AddOption("Автоматизираното тестване трябва да се прилага във всеки софтуерен проект. ", 0.5);
	q112.AddOption("Избраните архитектурни и технологични решения в проекта не влияят при избора на инструментите за тестване.", 0.5);
	q112.AddOption("Съществуват изключително малко на брой инструменти за автоматизация на тестването.", -1);
	
	Question q113("Как се дефинира понятието Benchmarking:");
	q113.AddOption("Процес, при който производителността на системата се сравнява с производителността........при тестване на предходни нейни версии", -1);
	q113.AddOption("Процес, при който производителността на системата се определя въз основа на.......продукционна среда", -1);
	q113.AddOption("Процес, при който производителността на системата се сравнява с изходните данни.......стандарти, дефинирани от външни организации", 1);
	
	Question q114("Кои са типичните проблеми, които могат да се появят по време на етапа Анализ на изискванията?");
	q114.AddOption("Чести промени на договорените изисквания", -1);
	q114.AddOption("Нереалистични очаквания на потребителите", -1);
	q114.AddOption("Лоша комуникация", -1);
	q114.AddOption("Всички изброени", -1);
	
	Question q115("Какво включва дефиницията за риск?");
	q115.AddOption("Реален проблем, който изисква неотложно решение", -1);
	q115.AddOption("Въздействието, което появил се проблем може да има върху нормалното функциониране на системата", 0.5);
	q115.AddOption("Вероятността от появата на даден проблем", 0.5);
	
	Question q116("Какво означава съкращението BIT? ");
	q116.AddOption("Bug in Test", -1);
	q116.AddOption("Build-in Testability", -1);
	q116.AddOption("Big-Band Integration Test", -1);
	q116.AddOption("Built in Test", 1);
	
	Question q117("Как се дефинира понятието Baselines: ");
	q117.AddOption("Основа, която се използва за оценка на производителността и откриване на отклоненията в рамките на различните версии на системата", 1);
	q117.AddOption("Основа, която се използва за оценка на производителността и откриване на отклоненията в отделни модули на системата", -1);
	q117.AddOption("Стандарт за сравнение на производителността на системата с тази на други подобни системи", -1);
	
	Question q118("Какво представлява скалируемостта на дадена система?");
	q118.AddOption("Способност на приложението да поема допълнителен товар посредством добавяне на ресурси, като процесор, памет и т.н.", -1);
	q118.AddOption("Способност на приложението да поема допълнителен товар без да се влияе върху производителността посредством добавяне на ресурси, като процесор, памет и т.н.", 1);
	q118.AddOption("Способност на приложението да поема допълнителен товар без да се влияе върху производителността посредством оптимизиране на неговия програмен код", -1);
	
	Question q119("Тестовото покритие е валидно за: ");
	q119.AddOption("Тестване на ниво програмни единици", -1);
	q119.AddOption("Тестване на системно ниво", -1);
	q119.AddOption("Тестване на интеграционно ниво", -1);
	q119.AddOption("Тестване на всички нива", 1);
	
	Question q120("Очакванията за качеството на софтуера на клиент (customer) и потребител (user):");
	q120.AddOption("Се различават, че клиентът има допълнително очакване за цената", -1);
	q120.AddOption("Се различават, че потребителят има допълнително очакване за цената", -1);
	q120.AddOption("Не се различават", 1);
	
	Question q121("Кое от изброените НЕ е тип дейност от Осигуряване на качеството (Quality Assurance) според класификационната схема на Тиан, разгледана в курса?");
	q121.AddOption("Превенция на дефектите (Defect prevention)", -1);
	q121.AddOption("Ограничаване на дефектите (Defect containment)", -1);
	q121.AddOption("Управление на дефектите (Defect handling)", 1);
	q121.AddOption("Намаляване на дефектите (Defect reduction)", -1);
	
	Question q122("Дейностите по верификация се извършват преимуществено:");
	q122.AddOption("В самото начало на проекта", -1);
	q122.AddOption("В самия край на проекта", -1);
	q122.AddOption("В рамките на процеса на разработване на софтуера ", 1);
	
	Question q123("Кой тип тестване може да се използва и за верификация, и за валидация?");
	q123.AddOption("Тестване на ниво система (System testing)", 1);
	q123.AddOption("Тестване на единица (Unit testing)", -1);
	q123.AddOption("Тестване на приемане (Acceptance testing)", -1);
	
	Question q124("Коя от изброените активности се извършва обикновено при прехода от една фаза в друга или от една дейност от разработването към друга:");
	q124.AddOption("Тестване (Testing)", -1);
	q124.AddOption("Превенция на дефектите (Defect prevention)", -1);
	q124.AddOption("Преглед на качеството (Quality review)", 1);
	q124.AddOption("Ограничаване на дефектите (Defect containment)", -1);
	
	Question q125("При подхода fault tolerance:");
	q125.AddOption("Се взимат мерки, след като са се случили глобални откази, за да се ограничат пораженията", -1);
	q125.AddOption("Се толерират повреди и локални откази, така че да не стават глобални откази", 1);
	q125.AddOption("При подхода failure containment", -1);
	
	Question q126("Какво предимство предоставя тестването с класове на еквивалентност?");
	q126.AddOption("Възможност за използване на опита на крайните потребители при генериране на тестовите сценарии ", -1);
	q126.AddOption("Редуциране на броя на тестовите сценарии", 1);
	q126.AddOption("Възможност за тестване на сложни софтуерни системи ", -1);
	
	Question q127("Кой от изброените въпроси се засяга основно в плана за качество на проект?");
	q127.AddOption("Методология, прилагана в проекта", -1);
	q127.AddOption("Критерии за начало и край на всеки етап от проекта", 1);
	q127.AddOption("Оценка на риска", -1);
	q127.AddOption("Графици за изпълнението на проекта", -1);
	
	Question q128("Инспекциите са свързани повече с:");
	q128.AddOption("Верификацията", 1);
	q128.AddOption("Валидацията", -1);
	
	Question q129("Кои от изброените са верни за компонентно-базираното разработване?");
	q129.AddOption("При компонентното разработване трудно се управляват изискванията", 0.5);
	q129.AddOption("Верификацията и валидацията са по-трудни и по-важни", 0.5);
	q129.AddOption("Компонентното разрабоване е част от системното разработване", -1);
	q129.AddOption("Изисква се повече усилие за разработването на системи", -1);
	
	Question q130("Цена за откриване и отстраняване на грешка (несъответствие) е най-висока при:");
	q130.AddOption("Изграждане на софтуерното решение – кодиране ", -1);
	q130.AddOption("Преглед на спецификацията на решението ", -1);
	q130.AddOption("Реална експлоатация на софтуерната система", 1);
	
	Question q131("При кой от софтуерните процеси за разработване на софтуер интеграционното тестване НЕ заема особено важно място като дейност за осигуряване на качеството?");
	q131.AddOption("Инкрементален и итеративен процес", 1);
	q131.AddOption("Спираловиден процес", -1);
	q131.AddOption("Гъвкави процеси", -1);
	q131.AddOption("Процес на водопада", -1);
	
	Question q132("Кое от твърденията е вярно:");
	q132.AddOption("Тестването при гъвкавите методологии е отделна фаза в процеса на разработка и се извършва след като системата е завършена", -1);
	q132.AddOption("Методологията за разработване на софтуер, базирано на тестове (TDD),  използва тестове от тип „черна кутия“ ", -1);
	q132.AddOption("При екстремното програмиране (XP) тестването и имплементацията се извършват успоредно", -1);
	
	Question q133("Кога се дефинират критериите за приемане на програмната система?");
	q133.AddOption("По време на анализа на изизкванията", -1);
	q133.AddOption("При създаването на тест плана", 1);
	q133.AddOption("По време на проектирането на програмната система", -1);
	q133.AddOption("По време не финалното системно тестване", -1);
	
        exam.push_back(q9);
        exam.push_back(q10);
        exam.push_back(q11);
        exam.push_back(q12);
        exam.push_back(q13);
        exam.push_back(q14);
        exam.push_back(q15);
        exam.push_back(q16);
        exam.push_back(q17);
        exam.push_back(q18);
        exam.push_back(q19);
        exam.push_back(q20);
        exam.push_back(q21);
        exam.push_back(q22);
        exam.push_back(q23);
        exam.push_back(q24);
        exam.push_back(q25);
        exam.push_back(q26);
        exam.push_back(q27);
        exam.push_back(q28);
        exam.push_back(q29);
        exam.push_back(q30);
        exam.push_back(q31);
        exam.push_back(q32);
        exam.push_back(q33);
        exam.push_back(q34);
        exam.push_back(q35);
        exam.push_back(q36);
        exam.push_back(q37);
        exam.push_back(q38);
        exam.push_back(q39);
        exam.push_back(q40);
        exam.push_back(q41);
        exam.push_back(q42);
        exam.push_back(q43);
        exam.push_back(q44);
        exam.push_back(q45);
        exam.push_back(q46);
        exam.push_back(q47);
        exam.push_back(q48);
        exam.push_back(q49);
        exam.push_back(q50);
        exam.push_back(q51);
        exam.push_back(q52);
        exam.push_back(q53);
        exam.push_back(q54);
        exam.push_back(q55);
        exam.push_back(q56);
        exam.push_back(q57);
        exam.push_back(q58);
        exam.push_back(q59);
        exam.push_back(q60);
        exam.push_back(q61);
        exam.push_back(q62);
        exam.push_back(q63);
        exam.push_back(q64);
        exam.push_back(q65);
        exam.push_back(q66);
        exam.push_back(q67);
        exam.push_back(q68);
        exam.push_back(q69);
        exam.push_back(q70);
        exam.push_back(q71);
        exam.push_back(q72);
        exam.push_back(q73);
        exam.push_back(q74);
        exam.push_back(q75);
        exam.push_back(q76);
        exam.push_back(q77);
        exam.push_back(q78);
        exam.push_back(q79);
        exam.push_back(q80);
        exam.push_back(q81);
        exam.push_back(q82);
        exam.push_back(q83);
        exam.push_back(q84);
        exam.push_back(q85);
        exam.push_back(q86);
        exam.push_back(q87);
        exam.push_back(q88);
        exam.push_back(q89);
        exam.push_back(q90);
        exam.push_back(q91);
        exam.push_back(q92);
        exam.push_back(q93);
        exam.push_back(q94);
        exam.push_back(q95);
        exam.push_back(q96);
        exam.push_back(q97);
        exam.push_back(q98);
        exam.push_back(q99);
        exam.push_back(q100);
        exam.push_back(q101);
        exam.push_back(q102);
        exam.push_back(q103);
        exam.push_back(q104);
        exam.push_back(q105);
        exam.push_back(q106);
        exam.push_back(q107);
        exam.push_back(q108);
        exam.push_back(q109);
        exam.push_back(q110);
        exam.push_back(q111);
        exam.push_back(q112);
        exam.push_back(q113);
        exam.push_back(q114);
        exam.push_back(q115);
        exam.push_back(q116);
        exam.push_back(q117);
        exam.push_back(q118);
        exam.push_back(q119);
        exam.push_back(q120);
        exam.push_back(q121);
        exam.push_back(q122);
        exam.push_back(q123);
        exam.push_back(q124);
        exam.push_back(q125);
        exam.push_back(q126);
        exam.push_back(q127);
        exam.push_back(q128);
        exam.push_back(q129);
        exam.push_back(q130);
        exam.push_back(q131);
        exam.push_back(q132);
        exam.push_back(q133);

	unsigned questionsCount = exam.size();
	for (unsigned i = 0; i < questionsCount; ++i)
		std::swap(exam[Randomize(exam.size())], exam[Randomize(exam.size())]);
	for (unsigned i = 0; i < exam.size(); ++i)
	{
		if (i == questionsCount)
		{
			std::cout << "Sekciq sus sgresheni vuprosi\nnatisnete nqkoy buton\n";
			std::cin >> useless;
			system("CLS");
		}
		std::cout << 1 + i << '/' << exam.size() << '\n';
		exam[i].AskQuestion();
		if (exam[i].AnswerQuestion() != 1 && !flag)
			exam.push_back(exam[i]);
		std::cin >> useless;
		system("CLS");
	}
	std::cout << "Congratulations for reaching the end!\nYour score is: " << counter << '/' << exam.size();
	std::cin >> useless;
	return 0;
}
